import telebot
import logging

# ===== НАСТРОЙКИ =====
TOKEN = "8733856481:AAHx4XmepOb4htYPIxnD7ShxG3EooxuiyU4"  # Замени на токен от @BotFather
# =====================

bot = telebot.TeleBot(TOKEN)
logging.basicConfig(level=logging.INFO)

# Текст из форума (тот, который ты скинул)
FAQ_TEXT = """Главная
Форумы
Пользователи
База знаний
Правила проекта
Жалобы
Тех.раздел
Discord
Сменить сервер…
Раздел навигации
Найти темы
Отслеживаемое
Поиск сообщений
Прочитать всё
Форум – Arizona RolePlay
Alex_Mansorу Поиск
Mesa Central Office || FAQ по ЦА
Автор темы: Alberto Uno Дата начала: 5 Фев 2024
Форумы Раздел игровых серверов Сервера Arizona RP Сервер №7 [Mesa] 🤨 Государственные структуры Central Office || Центральный аппарат
В этой теме нельзя размещать новые ответы.
Отслеживать

Alberto Uno
ГС Ghetto
Администратор
Регистрация: 31 Май 2021
Сообщения: 5,706
Реакции: 884
Сервер: Mesa
5 Фев 2024
#1

В данной теме вы можете ознакомиться с FAQ Центрального аппарата.
FAQ - собрание часто задаваемых вопросов от сотрудников работающих в данной организации.

Средства Массовой Информации — совокупность органов публичной передачи информации с помощью технических средств; до сих пор более употребительное в русском языке (по сравнению с термином «средства массовой коммуникации») обозначение средств повседневной практики сбора, обработки и распространения сообщений массовым аудиториям.

К современным средствам массовой информации относятся: печать, радио, телевидение и сеть Интернет. До появления радио, телевидения и сети Интернет - печать была главным средством общения, передачи и сохранения знаний и культуры. Первыми печатными изданиями были книги, брошюры и листовки. В начале XVII века появились газеты, а к середине того же века - журналы. В дальнейшем растущий спрос на разнообразную информацию стимулировал массовый выпуск газет и журналов, появление в середине XIX века информационных агентств. Развитию печати также способствовал прогресс печатной техники и технологии.

Государственный Центр Лицензирования или же Автошкола - это государственное учреждение, в котором происходит обучение граждан вождению транспортными средствами и выдача лицензий на вождение т/с. Данные лицензии можно получить, путем сдачи экзаменов по вождению или же путем покупки лицензии. Стоимость лицензии может измениться в связи с состоянием экономики или состояния банковского счета фракции. Гос.Центр Лицензирования имеет право на проверку лицензий у сотрудников любой государственной структуры. При этом, данная фракция не имеет права проводить технический осмотр автомобилей.

Правительство (Government) - высший коллегиальный исполнительный орган государственного управления, формируемый из руководителей органов государственного управления штата и других государственных служащих, либо (в широком смысле) общая система государственного управления.

Реклама
Автопарк
Описание персонажа
Проведение лекций
Правила использования рации департамента
Правила использования командой /expel (выгнать с офиса)
Правила продажи газет и установки лавок
Правила размещения палаток продажи лицензий
Единый устав Средств Массовой Информации [ПРО, ППЭ, ППА]
Единый устав Государственного Центра Лицензирования
Единый устав Правительства
Альтернативная система повышений Средств Массовой Информации
Альтернативная система повышений Государственного Центра Лицензирования
Перечень обязанностей и наказаний
Адвокатская деятельность

Последнее редактирование модератором: 25 Ноя 2025

#2
При подписании контракта об рекламе орг. лидер/заместитель СМИ должен скринить/фрапсить полный разговор!
Лидер/заместитель орг. который хочет заключить контракт обязан обговорить все условия.
Должны быть обговорены все сроки проведения эфиров в день или в неделю.
СМИ может отказать в рекламе лидеру/заместителю орг.
Лидер/заместитель СМИ может предложить цену обговорённую с противоположной стороной.
Нормы цен за рекламу начинаются от: 500.000. Заканчиваются до: 3.000.000.
Если рекламодатель не выполняет все условия которые были обговорены, на него накладывается штраф в размере от 2.000.000 до 5.000.000.

#3
Наземный Транспорт:
- Автомобиль Toyota RAV4
- Автомобиль NewsVan
Воздушный Транспорт:
- Вертолет News Maverick

#4
Система описания создана для того, чтобы игроки могли заранее описать какие-то внешние черты своего персонажа, которые не позволяет отобразить игровой мод, дабы не описывать их каждый раз в /do.
1. Допускаются только РП описания.
2. Описание должно содержать информацию, которую действительно можно узнать, взглянув на человека. [Как правило вы не можете сказать с какого города человек, взглянув на него и т.п.]
3. В описание не должна присутствовать нецензурная лексика.
4. За нрп описание от 7+ ранга лидер будет получать устный выговор.
5. Пример РП описания:
"Парень среднего роста с ярко зеленными глазами и обветренными губами. На вид 23-24 года. Сбиты костяшки на руках, а также из под рукава виднеется татуировка дракона."

#5
Критерии составления и прочтения лекций:
- Лекция должна разъяснять основные моменты работы в СМИ.
- Лекция должна доносить до сотрудников информацию из уставных документов.
- Лекция должна побуждать интерес к теме доносимого.
- Лекция должна быть разумных объемов. [В зависимости от темы. Не нужно копировать устав целиком и полностью].
- Лекция должна быть написана заранее и заучена. [Биндер].
- Лекция должна читаться в нормальном темпе и разборчивым голосом. [Интервал между сообщениями в биндере - 5 секунд].

#6
Канал департамента (/d) - внутренний канал связи государственных организаций.

Канал департамента предназначен для:
1. Связи с другими государственными организациями.
2. Связи и координирования экстренных служб, во время терактов и ЧС.
3. Контроля заполненности оружейных складов.
4. Предупреждении о занятии гос. волны.

В канале строго запрещается:
1. Несоблюдение метагейминга: ✗ /d Не могу доставить вам боеприпасов, мне скоро в школу на матан
2. Создание OOC чата: ✗ /d (( Ребят я ща выходить буду, всем до завтра ))
3. Смешивание чатов IC и OOC: ✗ /d Боец (( ид 610 )) не соблюдает устав.
4. Откат каких-либо сообщений в ООС чат: ✗ /d (( откат )) (если ошиблись - пишите "Упала рация")
5. Оффтоп: ✗ Любого рода поздравления (С ДР, с 8 марта, со свадьбой, с повышением)

Идентификация или обращение к человеку:
Замены ID сотрудников гос. служб:
1. В армии и полиции - жетон, значок или нашивка.
2. В остальных гос. организациях - имя на бейджике или номер авто.

✓ /d [Пра-во] - [ЛСПД] Ваш сотрудник с жетоном 0-7-5 неправомерно забрал у меня права.
✓ /d [Пра-во] - [ГЦЛ] Инструктор Гектор Вард взял деньги, но не выдал мне лицензию на ловлю рыбы.
✗ /d [Пра-во] - [ГЦЛ] 75 id лишил меня всех лицензий.
✗ /d [ГЦЛ] - [СФа] Юки Лейн на КПП прострелил мне колесо.

Важно: Все имена пишутся без нижнего подчеркивания "_". По РП вам неизвестны имена других людей, поэтому используйте только ID игрока.

Замены слов:
Материалы (БП, маты) - боеприпасы.
"укроп" ("укроп", порошок) - "укроп"тические средства.

✓ /d [СФПД] - [СФа] Требуется доставка боеприпасов
✓ /d [ФБР] - [ЛСПД] У вашего сотрудника, при обыске, были найдены не лицензированные боеприпасы.
✗ /d [СФПД] - [СФа] Доставьте нам бп, мы на нуле
✓ /d [ФБР] - [ЛВПД] У вашего бойца с жетоном 100, при обыске найдены "укроп"тические средства
✓ /d [ЛСа] - [ФБР] Фуры выехали к вам, ожидайте
✗ /d [ЛСа] - [ЛСПД] Матовозы выехали, ожидайте

Формы обращений:
Тюрьма строгого режима LV - [ТСР]
LSPD - [ЛСПД]
SFPD - [СФПД]
LVPD - [ЛВПД]
RCSD - [РКШД]
FBI - [ФБР]
Goverment - [Пра-во]
Army LS - [ЛСа]
Army SF - [СФа]
Insurance company - [СтК]
Hospital LS - [ЛСМЦ]
Hospital LS (частная) - [ДЖМЦ]
Hospital SF - [СФМЦ]
Hospital LV - [ЛВМЦ]
Driving school - [ГЦЛ]
Radiocentre LS - [СМИ ЛС]
Radiocentre SF - [СМИ СФ]
Radiocentre LV - [СМИ ЛВ]

#7
Процедура /expel (выгнать с офиса):
1) Прежде чем выгнать, обязательно отыграть дубинку: /me достал дубинку с пояса, взял её в правую руку
2) После использования дубинки, отыграть /expel: /me взял рацию и вызвал охрану, /do Охрана выводит нарушителя, /expel id Причина
3) Каждое использование /expel фиксировать видео или фото.

За что можно выгнать:
1) Неадекватное/неуважительное поведение - НПСК/НПГЦЛ/НПСМИ/НПП
2) Срыв собеседований/лекций - НПСК/НПГЦЛ/НПСМИ/НПП
3) Ношение оружия в открытом виде - НПСК/НПГЦЛ/НПСМИ/НПП
4) Торговля/попрошайничество - НПСК/НПГЦЛ/НПСМИ/НПП
5) Угрозы сотрудникам или гражданам - НПСК/НПГЦЛ/НПСМИ/НПП
6) Игнорирование требований сотрудников - НПСК/НПГЦЛ/НПСМИ/НПП
7) Создание помехи работе - НПСК/НПГЦЛ/НПСМИ/НПП
8) Агитация в мэрии - НПП

За что запрещено выгонять:
1) Афк без еск (Долгий сон)
2) Причина "Помеха"
3) Причина с матом
4) Просто так выгонять/глушить дубинкой

#8
Продажа газет и палатки:
1) Сотрудник имеет право попросить палатку у руководства, если есть допущенная к продаже газета.
2) После продаж вернуть палатку в целости.
3) Спросить разрешение у руководства перед продажей.
4) Продавать газеты только в своем городе.
5) Продавать только возле палатки.
6) Продажа разрешена в любое время.

Места установки палаток:

Лос-Сантос:
- ЦБ: /gps > Важные места > [13] [LS] Центральный банк
- ЦР: /gps > Разное > [15] [LS] Центральный рынок
- Вокзал ЛС: /gps > Важные места > [11] [LS] Вокзал

Сан-Фиеро:
- АБ: /gps > Разное > [11] [SF] Автобазар
- Центр занятости: /gps > Важные места > [6] [SF] Центр занятости
- Вокзал СФ: /gps > Важные места > [35] [SF] Вокзал

Лас-Вентурас:
- Казино: /gps > Разное > [12] [LV] Казино 4 дракона
- Вокзал ЛВ: /gps > Важные места > [28] [LV] Вокзал
- Больница ЛВ: /gps > Важные места > [29] [LV] Больница

Форт Карсон:
- /gps > Важные места > [FC] Станция Форт Карсон

Запрещено:
- ставить палатки, мешающие проходу
- ставить у выхода из интерьеров
- использовать для залезания в труднодоступные места
- ставить рядом друг с другом
- ставить в интерьерах
- ставить на крышах, машинах
- ставить на дорогах
- стоять на палатке

#10
Перечень обязанностей и наказаний

1. Лидер отвечает за старший состав.
2. Лидеру/заму запрещено AFK без ESC более 10 минут. [kick + устный выговор]
3. Игрокам 6-7 ранга запрещено получать деморган/варн/бан. [Устный выговор]
4. Игрокам 8-9 ранга запрещено получать деморган/варн/бан. [Строгий выговор]
5. Игрокам 8+ ранга запрещено бредовое описание. [Устный выговор]
6. Игрокам 6+ ранга запрещено нарушать правила фракции и сервера.
7. Игрокам 5+ ранга запрещено посещать мероприятия, автобазар, казино, рынок до конца рабочего дня. [Увольнение/выговор]
8. Лидер может назначить: три 9-х ранга, четыре 8-х ранга.
9. Игрок может оспорить действия лидера, если они противоречат правилам.
10. Сотрудник госоргана обязан знать Конституцию штата.
11. Лидер может расформировать состав с одобрения главного следящего.
12. Игрок 6+ ранга обязан изучить правила использования /d.
13. Игроку 6+ ранга желательно быть в Discord фракции.
14. Запрещено: неуважение к админам/игрокам, несоблюдение правил, оскорбления, мат, читы, нарушение RP, действия без отыгровки.
15. Сотрудник госоргана обязан обращаться на "Вы". [Выговор/увольнение]
16. Сотрудник обязан быть на рабочем месте в рабочее время.
17. Сотрудник обязан участвовать в жизни фракции и сервера.
18. Запрещены дуэли между сотрудниками госорганов (кроме совместных тренировок).
19. Запрещено хранение запрещенных средств. [Увольнение]
20. В ГРП могут участвовать только игроки 6+ ранга (1+ для массовки под ответственность лидера).
21. Старший ранг (6+) в рабочей форме обязан соблюдать РП в любое время.
22. Онлайн с 17:00 до 21:00 не ниже 10 человек (без ЧОП). [Устный выговор лидеру]
23. Запрещено занимать должности в правительстве (судья, прокурор) и одновременно быть в госоргане с другого акка. Исключение: до 5 ранга. [Увольнение + ЧС Пра-во 1 месяц]
24. Работоспособность фракции >50% от нормы онлайна 17:00-21:00. [-5 баллов]
25. Прогул рабочего дня лидером/замом. [-25 баллов]
26. Нарушение устава лидером/замом. [-10 до -25 баллов]
27. Массовое нарушение устава сотрудниками. [-8 до -25 баллов]
28. Игнорирование нарушений лидером/замом. [-8 до -25 баллов]

#11
Адвокатская деятельность:
Правила в теме F.A.Q МЮ: https://forum.arizona-rp.com/threads/7925388/page-2#post-48664497
"""

@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.reply_to(message, "Привет! Отправь /faq чтобы получить справочник по госструктурам Arizona RP Mesa.")

@bot.message_handler(commands=['faq'])
def send_faq(message):
    # Разбиваем на части, если текст слишком длинный (Telegram лимит ~4000 символов)
    parts = [FAQ_TEXT[i:i+4000] for i in range(0, len(FAQ_TEXT), 4000)]
    for part in parts:
        bot.send_message(message.chat.id, part)

@bot.message_handler(func=lambda m: True)
def echo_all(message):
    bot.reply_to(message, "Используй команду /faq")

if __name__ == "__main__":
    print("Бот запущен...")
    bot.infinity_polling()
